Revit 2027 API
MEPSystem.HasPlaceholders Property
 Indicates if the system has one or more placeholders.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasPlaceholders { get; }
Public ReadOnly Property HasPlaceholders As Boolean
	Get
public:
property bool HasPlaceholders {
	bool get ();
}
member HasPlaceholders : bool with get
Property Value
Boolean
See Also
Reference
MEPSystem Class
Autodesk.Revit.DB Namespace